import { Component } from 'react'
import Markdown from 'Markdown'
import Footer from 'Footer'

export default class About extends Component {
   static defaultProps = {
      version: "1.7",
      title: "Задумка",
      title_text: "Основной замысел проекта «Днеслов» это создание обединённой православной агиографической платформы",
      desc: "Цели и задачи",
      desc_text: "1. Днеслов это календарная платформа, которая позволяет переключаться динамически от календаря к календарю поместных церквей и/или календарям епархий с местночтимыми святыми, и имеющий интерфейс и тексты (в т.ч. богослужебные), без ограничения в подборе языков, включая и древние\n\n2. Краткие ёмкие тексты житий и праздников на основе существующих житий и современных научных исследований на русском языке (в среднем 2000 знаков), которые можно использовать в электронном и печатном видах, а также для чтения в храме как пролог.\n\n3. Перевод (частичный) новых житий на церковнославянский язык в виде *нового* пролога.\n\n4. Тропари и кондаки на многие недостающие праздники и памяти святых и образов Богородицы.\n\n5. В электронном виде частично представлены напевы тропарей и начитка статей пролога.\n\n6. Выборочная качественная подборка традиционного вида символов и лучших икон старых и современных иконописцев.\n\n7. Есть т.н. «дивные» календари, например, содержащий более 30 житий, написанных в стихах.\n\n8. Возможность на лету выпустить издание, готовое для изготовления необходимых материалов в печатном виде память занимает в среднем 3 страницы книжного формата: житие, икона, тропарь, кондак, и пролог (примерно 5000-6000 знаков).\n\n9. Разработка многоязычный интерфейс и возможность переводить тексты на разные языки.\n\n10. Смысловая подборка традиционного вида икон, с возможностью хранить для них информационные карточки, подобно порталам, заточенным на искусствоведение.\n\n11. Планируется к выпуску механизма нотировки богослужебных последований, в том числе и в крюковой нотации со ссылками на источники (если они есть).",
      done: [
         'Версия',
         'Полнотекстовый поиск по календарю',
         'Выборка памятей по дате',
         'Выборка памятей по календарю',
         'Ссылки на сторонние календари и статьи о празднике или святом',
         'Иконы праздника или святого',
         'Краткое описание праздника или подвига святого',
         'Тропари и кондаки святому или празднику',
         'Удобная выборка дат',
         'Поддержка календарей: календарь РПЦ',
         'Поддержка браузеров: Firefox, Chrome (для компьютера и android)',
         'Вводный путеводитель по календарю',
         'API доступа к базе памятей',
         'Адаптивная вёрстка',],
      planned: [
         'Многоязычность, поддержка языков: английский, сербский, болгарский, украинский, польский, греческий, грузинский, румынский, чешский, словацкий.',
         'Общий сводный календарь святых и праздников',
         'Автоматический уставщик',
         'Богослужение на-ряду',
         'Карта святынь с поддержкой yandex-карт',
         'Возможность поддержки разных иных календарей поместных православных церквей',
         'Возможность поддержки старых или современных справочников святых и праздников',
         'Возможность поддержки древних печатных календарей',],
      changelog: {
         "1.7": [
            "Створены таблицы и страинцы чинопоследований",
            "Вложеннные помины на страницах памяти и события",
            "Значки и возможность проигрывания для звуков на страницах памяти и события",
            "Галерея икон",
            "Малые правки в админке и на страницах",
         ],
      },
      i18n: {
         version: "Справа",
         changelog: "Список изменений",
      }
   }

   render() {
      console.log('props', this.props)

      return (
         [<header>
            <nav className='terracota'>
               <div className="nav-wrapper about">
                  <a className='brand-logo'
                     href='/'
                     alt="Днеслов">
                     <img
                        src="/dneslov-title.png" /></a></div></nav></header>,
      <main>
         <div className='container about'>
            <div className='row'>
               <div className='col s12 m12 l12 xl12'>
                  <div id='page'>
                     <h5>{this.props.title}</h5>
                     <div><Markdown source={this.props.title_text} /></div>
                     <h5>{this.props.desc}</h5>
                     <div><Markdown source={this.props.desc_text} /></div>
                     <table className='highlight'>
                        <tbody>
                           <tr>
                              <td><h5>Текущие особенности календаря</h5></td>
                              <td></td></tr>
                           {this.props.done.map((r, index) =>
                              <tr>
                                 <td>{r}</td>
                                 <td>
                                    {index == 0 &&
                                       this.props.version ||
                                       <i
                                          className='small material-icons green'>
                                          done</i>}
                                 </td>
                              </tr>)}
                           <tr>
                              <td><h5>Планирующиеся особенности календаря</h5></td>
                              <td></td></tr>
                           {this.props.planned.map((r) =>
                              <tr>
                                 <td>{r}</td>
                                 <td>
                                    <i
                                       className='small material-icons red'>
                                       edit</i>
                                 </td>
                              </tr>)}
                           <tr>
                              <td>
                                 <a href='/'>Идти к календарю</a></td>
                              <td>
                                 <a href='/'><i className='small material-icons green'>call_made</i></a></td></tr>
                        </tbody>
                     </table>
                     <h5>{this.props.i18n.changelog}</h5>
                     <div>{Object.keys(this.props.changelog).map((version) => {
                        return <div>{this.props.i18n.version}: <span>{version}</span><ol>{this.props.changelog[version].map((x) => <li>{x}</li> )}</ol></div>
                     })}</div>
            </div></div></div></div></main>,
         <Footer />])
   }
}
