# language: ru
@uploader @animation
Свойство: Загрѫзка анимације без измѣненја кадров и повторенја

   Структура сценария: Загрѫзчик храни кадри, паузе и повторенје анимације
      Допустим єствує прѣдвижьба "<формат>" сꙛ повторенјем "<повторенје>" раза
      Если картинка є загрѫженој чрѣз "<загрѫзчик>"
      То кадри, паузе и повторенје извода сѫ сохранеными
      И кадри, паузе и повторенје мелкашке сѫ сохранеными
      И врѣменне слике анимације сѫ изјѧтыми

      Примеры:
         | формат | повторенје | загрѫзчик       |
         | GIF    | 3          | ImageUploader   |
         | GIF    | 3          | PicturaUploader |
         | GIF    | 3          | RoundelUploader |
         | WEBP   | 3          | ImageUploader   |
         | WEBP   | 3          | PicturaUploader |
         | WEBP   | 3          | RoundelUploader |
         | GIF    | 0          | ImageUploader   |
         | GIF    | 0          | PicturaUploader |
         | GIF    | 0          | RoundelUploader |
         | WEBP   | 0          | ImageUploader   |
         | WEBP   | 0          | PicturaUploader |
         | WEBP   | 0          | RoundelUploader |

   Структура сценария: Загрѫзчик храни прозрачны кадри сꙛ отстѫпами
      Допустим єствує прозрачна прѣдвижьба "<формат>" сꙛ отстѫпами кадров
      Если картинка є загрѫженој чрѣз "<загрѫзчик>"
      То прозрачны кадри извода сѫ сохранеными
      И врѣменне слике анимације сѫ изјѧтыми

      Примеры:
         | формат | загрѫзчик       |
         | GIF    | ImageUploader   |
         | GIF    | PicturaUploader |
         | GIF    | RoundelUploader |
         | WEBP   | ImageUploader   |
         | WEBP   | PicturaUploader |
         | WEBP   | RoundelUploader |

   Пример: Ошибка творьбе анимације не оставляє врѣменных слик
      Допустим єствує прѣдвижьба "GIF" сꙛ повторенјем "3" раза
      Если творьба анимације є прерваној ошибкој webpmux
      То ошибка обработке є повращеној
      И врѣменне слике анимације сѫ изјѧтыми
