# language: ru
@model @event
Функционал: Прича сꙛбытя
   Предыстория:
      * єствує ѧзык "Русский" яко "ру"
      * єствує азбука "Русская" яко "РУ"
      * сѫ взори сꙛбытєв "Canonization, Benediction"

   @language
   Сценарий: Завѣрка полеј приче сꙛбытя
      Если установиме причу сꙛбытя
      И својства "kind, kind_code" приче не могѫ быти пустыми
      И сꙛбытє имає родъ "integer" для слѣдѫчых столбцов:
         | столбец            |
         | id                 |
         | item_id            |
         | type_number        |
         | place_id           |

      И сꙛбытє имає родъ "string" для слѣдѫчых столбцов:
         | столбец            |
         | kind_code          |
         | happened_at        |
         | person_name        |
         | about_string       |
         | tezo_string        |
         | order              |
         | council            |

   Сценарий: Завѣрка многосвѧзности полеј приче сꙛбытя
      Если установиме причу сꙛбытя
      То својство "kind" приче є одношенєм до приче "Subject"
      И својство "place" приче є одношенєм до описуєма
      И својство "item" приче є одношенєм до описуєма


   @language
   Сценарий: Дѣјствителна запись сꙛбытя
      Допустим єствує памѧть "Василий Памятливый"
      И єствує русьско мѣсто "Красная площадь"

      Если створиме нове сꙛбыте сꙛ полями:
        | happened_at         | 10.10.1010            |
        | kind_code           | Benediction           |
        | memory_short_name   | Василий Памятливый    |
        | place_short_name    | Красная площадь       |
      То сꙛбытє "10.10.1010" бѫдє сѫствовати
