# language: ru
@model @resource
Свойство: Прича изнахоѕи
   @language
   Пример: Провѣрка полєј приче изнахоѕи
      Пусть ествує мнима изнахоѕь
      То својство 'resource' изнахоѕи сєя не можє быти пустꙛ

   Пример: Проверка выборок модели памяти
      Пусть сѫ изнахоѕи мниме "1"
      То выборка "by_id" изнахоѕи избирає поля "id"


   @language @description
   Пример: Проверка многосвязности поля имён
      Пусть ествує мнима изнахоѕь
      То ѫ изнахоѕи сєя сѫ дѣјсными многоимуча својства:
         | свойства        |
         | links           |
         | descriptions    |
         | titles          |


   Пример: Дѣјсна запись
      Пусть єствує изнахоѕь сꙛ даными:
         | id              | 300101                               |
         | type            | Resource::Virtual                    |
         | path            | Путь1                                |
         | props           | {'text': 'Текст1'}                   |
         | title           | Титулово                             |
         | description     | Описало                              |
         | resource_path   | features/fixtures/ice_rock_drop.mp3  |
      То изо изнахоѕи "Титулово" бѫдє яко:
         """
         ---
         id: 300101
         path: Путь1
         props:
           text: Текст1
         type: Resource::Virtual
         thumb_url:
         """
