# language: ru
@uploader @image_processing
Свойство: Творьба картинок чрѣз MiniMagick

   Структура сценария: Загрѫзчик твори WebP и мелкашькѫ со сѣрој обчьрненој рамкој
      Допустим єствує картинка размѣра "<вход>"
      Если картинка є загрѫженој чрѣз "<загрѫзчик>"
      То извод картинке є "WEBP" размѣра "<вход>"
      И мелкашка є "WEBP" размѣра "<выход>"
      И мелкашка имає сѣрѫ обчьрненѫ рамкѫ
      И врѣменне слике MiniMagick сѫ изјѧтыми

      Примеры:
         | загрѫзчик       | вход    | выход   |
         | ImageUploader   | 600x600 | 406x406 |
         | ImageUploader   | 800x400 | 406x206 |
         | ImageUploader   | 400x800 | 206x406 |
         | PicturaUploader | 600x600 | 406x406 |
         | PicturaUploader | 800x400 | 406x206 |
         | PicturaUploader | 400x800 | 206x406 |

   Структура сценария: RoundelUploader храни размѣръ мале картинке и умаляє велику
      Допустим єствує картинка размѣра "<вход>"
      Если картинка є загрѫженој чрѣз "RoundelUploader"
      То извод картинке є "WEBP" размѣра "<выход>"
      И врѣменне слике MiniMagick сѫ изјѧтыми

      Примеры:
         | вход    | выход   |
         | 200x200 | 200x200 |
         | 400x400 | 400x400 |
         | 401x401 | 400x400 |
         | 800x400 | 400x200 |
         | 800x200 | 800x200 |

   Пример: RoundelUploader храни прозрачность картинке
      Допустим єствує прозрачна картинка размѣра "200x200"
      Если картинка є загрѫженој чрѣз "RoundelUploader"
      То прозрачность картинке є сохраненој

   Структура сценария: Загрѫзчик твори самоповратность картинке
      Допустим єствує картинка со самоповратностјѫ "RightTop"
      Если картинка є загрѫженој чрѣз "<загрѫзчик>"
      То извод картинке є "WEBP" размѣра "40x80"

      Примеры:
         | загрѫзчик       |
         | ImageUploader   |
         | PicturaUploader |

   Пример: BookUploader твори мелкашькѫ со сѣрој обчьрненој рамкој
      Допустим єствує картинка размѣра "800x400"
      Если BookUploader твори мелкашькѫ картинке
      То мелкашка є "PNG" размѣра "406x206"
      И мелкашка имає сѣрѫ обчьрненѫ рамкѫ
      И врѣменне слике MiniMagick сѫ изјѧтыми

   Пример: Ошибка обработке не оставляє врѣменных слик
      Допустим єствує картинка размѣра "600x600"
      Если творьба мелкашьк є прерваној ошибкој MiniMagick
      То ошибка обработке є повращеној
      И врѣменне слике MiniMagick сѫ изјѧтыми

   Пример: Порчена картинка повращає ошибкѫ обработке
      Допустим єствує порчена картинка
      Если загрѫзчик твори мелкашькѫ порчене картинке
      То ошибка обработке є повращеној
      И врѣменне слике MiniMagick сѫ изјѧтыми
