# language: ru
@api @tag @controller
Свойство: Правач мѣт
   Предыстория:
      * єствує ѧзык "Русский" яко "ру"
      * єствує азбука "Русская" яко "РУ"
      * єствує ѧзык "Всисловенский" яко "вс"
      * єствує азбука "Всисловенщина" яко "НЦ"
      * єствує вид мѣте "обычна" яко "Простая мѣтка" во азѧте "ру_РУ"
      * єствує вид мѣте "помѣстна" яко "Помѣстна мѣтка" во азѧте "ру_РУ"
      * єствує мѣта сꙛ даными:
         | id              | 10000                                |
         | appellation     | Мѣта                                 |
         | title           | Славник Титул                        |
         | description     | Описаловое                           |
         | kind            | обычна                               |
         | language_code   | ру                                   |
         | alphabeth_code  | РУ                                   |
      * єствує имѧ "Имѧ" помѣчено сꙛ "Мѣта"
      * єствує мѣта сꙛ даными:
         | id              | 10001                                |
         | appellation     | Мѣтаа                                |
         | title           | Славника Титул                       |
         | description     | Описалово                            |
         | kind            | помѣстна                             |
         | language_code   | др                                   |
         | alphabeth_code  | ДР                                   |
      * єствує имѧ "Град" помѣчено сꙛ "Мѣтаа"
      * сꙛбуке для правача сѫ таковы:
         | language        | ру                                   |
         | alphabeth       | РУ                                   |

   @get @collection @json
   Пример: Запрос к правачу мѣт в АПИ при отсутствии мѣт
      Пусть не єствує ни єдне мѣте
      Если сдѣлаю "GET" запытъ до адреса "/api/v0/tags.json"
      То добѫдꙛ кодъ поврата "204"

   @get @collection @json
   Пример: Користник добыває списъ мѣт
      Если запытаю добыванје из изо "/api/v0/tags.json"
      То добѫдꙛ кодъ поврата "200"
      И добѫдꙛ выводъ:
         """
         ---
         - id: 10000
           kind: обычна
           appellation: Мѣта
           tagged_count: 0
         - id: 10001
           kind: помѣстна
           appellation:
           tagged_count: 0
         """
      А добѫдꙛ охватъ "0-9/2"

   @get @collection @search @json
   Пример: Користник искає во спису мѣт по мѣтну опозонавателю
      Если запытаю добыванје из изо "/api/v0/tags.json?uno=10000"
      То добѫдꙛ кодъ поврата "200"
      И добѫдꙛ выводъ:
         """
         ---
         - id: 10000
           kind: обычна
           appellation: Мѣта
           tagged_count: 0
         """
      А добѫдꙛ охватъ "0-9/1"

   @get @collection @search @json
   Пример: Користник искає во спису мѣт по типу
      Если запытаю добыванје из изо "/api/v0/tags.json?q=Описаловое"
      То добѫдꙛ кодъ поврата "200"
      И добѫдꙛ выводъ:
         """
         ---
         - id: 10000
           kind: обычна
           appellation: Мѣта
           tagged_count: 0
         """
      А добѫдꙛ охватъ "0-9/1"

   @get @collection @search @json
   Пример: Користник искає во спису мѣт по заглавку
      Если запытаю добыванје из изо "/api/v0/tags.json?l=ру"
      То добѫдꙛ кодъ поврата "200"
      И добѫдꙛ выводъ:
         """
         ---
         - id: 10000
           kind: обычна
           appellation: Мѣта
           tagged_count: 0
         """
      А добѫдꙛ охватъ "0-9/1"

   @get @collection @search @json
   Пример: Користник искає во спису мѣт по взору мѣте
      Если сꙛбуке для правача сѫ таковы:
         | language        | др                                   |
         | alphabeth       | ДР                                   |
      И запытаю добыванје из изо "/api/v0/tags.json?a=ДР"
      То добѫдꙛ кодъ поврата "200"
      И добѫдꙛ выводъ:
         """
         ---
         - id: 10001
           kind: помѣстна
           appellation: Мѣтаа
           tagged_count: 0
         """
      А добѫдꙛ охватъ "0-9/1"

   @get @collection @search @json
   Пример: Користник искає во спису мѣт по взору мѣте
      Если запытаю добыванје из изо "/api/v0/tags.json?a=ДР&l=ру"
      То добѫдꙛ кодъ поврата "204"
      И добѫдꙛ пустъ выводъ
      А добѫдꙛ охватъ "0-9/0"

   @get @collection @search @json
   Пример: Користник искає во спису мѣт по типу и взору мѣте
      Если запытаю добыванје из изо "/api/v0/tags.json?q=Описаловое&a=ДР"
      То добѫдꙛ кодъ поврата "204"
      И добѫдꙛ пустъ выводъ
      А добѫдꙛ охватъ "0-9/0"

   @get @collection @search @json
   Пример: Користник искає во спису мѣт по мѣтну єдозу
      Если запытаю добыванје из изо "/api/v0/tags.json?uno=Мѣта"
      То добѫдꙛ кодъ поврата "200"
      И добѫдꙛ выводъ:
         """
         ---
         - id: 10000
           kind: обычна
           appellation: Мѣта
           tagged_count: 0
         """
      А добѫдꙛ охватъ "0-9/1"

   @get @collection @json
   Пример: Запрос постраничный к правачу мѣт в АПИ
      Если сдѣлаю "GET" запытъ до адреса "/api/v0/tags.json" сꙛ доводом "per=1"
      То добѫдꙛ кодъ поврата "206"
      И добѫдꙛ выводъ:
         """
         ---
         - id: 10000
           kind: обычна
           appellation: Мѣта
           tagged_count: 0
         """
      А добѫдꙛ охватъ "0-0/2"
      Если сдѣлаю "GET" запытъ до адреса "/api/v0/tags.json" сꙛ доводом "per=1&p=2"
      То добѫдꙛ кодъ поврата "200"
      И добѫдꙛ выводъ:
         """
         ---
         - id: 10001
           kind: помѣстна
           appellation:
           tagged_count: 0
         """
      А добѫдꙛ охватъ "1-1/2"
      Если сдѣлаю "GET" запытъ до адреса "/api/v0/tags.json" сꙛ доводом "per=1&p=3"
      То добѫдꙛ кодъ поврата "416"

   @get @collection @json @error @416
   Пример: Запрос к правачу мѣт в АПИ
      Если сдѣлаю "GET" запытъ до адреса "/api/v0/tags.json" сꙛ доводом "page=111111"
      То добѫдꙛ кодъ поврата "416"
      И добѫдꙛ приблизнъ изводъ:
         """
         ---
         args:
           page: '111111'
         """

   @get @collection @json @error @416
   Пример: Запрос к правачу мѣт в АПИ
      Если сдѣлаю "GET" запытъ до адреса "/api/v0/tags.json" сꙛ заглавјем:
         """
         ---
         Range: records=100000-200000
         """
      То добѫдꙛ кодъ поврата "416"
      И добѫдꙛ приблизнъ изводъ:
         """
         ---
         """


   @create @object @json
   Пример: Користник створяє мѣту
      Если сꙛбуке для правача сѫ таковы:
         | language        | вс                                   |
         | alphabeth       | НЦ                                   |
      Если запытаю створенје изо мѣте "/api/v0/tags/create.json" сꙛ даными:
         | id              | 10002                                |
         | appellation     | Мѣтаб                                |
         | title           | Славника Титулб                      |
         | description     | Описалово б                          |
         | kind            | помѣстна                             |
         | language        | вс                                   |
         | alphabeth       | НЦ                                   |
      То добѫдꙛ кодъ поврата "200"
      А сѫбуке сѫ таковы:
         | language        | вс                                   |
         | alphabeth       | НЦ                                   |
      И изнахоѕь мѣте "Мѣтаб" бѫдє яко:
         """
         ---
         id: 10002
         kind: помѣстна
         appellation: Мѣтаб
         title: Славника Титулб
         description: Описалово б
         tagged_count: 0
         """

   @create @object @json @error @422
   Пример: Користник кушає створити погрѣшну мѣту во вымолву, и не можє
      Если запытаю створенје изо мѣте "/api/v0/tags/create.json" сꙛ даными:
         | id              | 10003                                |
         | appellation     | wrong                                |
         | title           | Славника Титулв                      |
         | description     | Описалово ѣ                          |
         | kind            | помѣстна                             |
         | language_code   | ру                                   |
         | alphabeth_code  | РУ                                   |
      То добѫдꙛ кодъ поврата "422"
      А сѫбуке сѫ таковы:
         | language        | ру                                   |
         | alphabeth       | РУ                                   |
      И добѫдꙛ выводъ:
         """
         ---
         status: 422
         errors:
         - Appellations text contains invalid char(s) "gnorw" for the specified alphabeth "РУ"
         - Appellations is invalid
         """
      А изнахоѕи мѣте "10003" не бѫдє

   @create @object @json @error @422
   Пример: Користник кушає створити погрѣшну мѣту во заглавку, и не можє
      Если запытаю створенје изо мѣте "/api/v0/tags/create.json" сꙛ даными:
         | id              | 10003                                |
         | appellation     | Мѣтаоо                               |
         | title           | wrong                                |
         | description     | Описалово ѣ                          |
         | kind            | помѣстна                             |
         | language_code   | ру                                   |
         | alphabeth_code  | РУ                                   |
      То добѫдꙛ кодъ поврата "422"
      А сѫбуке сѫ таковы:
         | language        | ру                                   |
         | alphabeth       | РУ                                   |
      И добѫдꙛ выводъ:
         """
         ---
         status: 422
         errors:
         - Titles text contains invalid char(s) "gnorw" for the specified alphabeth "РУ"
         - Titles is invalid
         """
      А изнахоѕи мѣте "10003" не бѫдє

   @create @object @json @error @200
   Пример: Користник кушає створити погрѣшну мѣту во описаню, але можє
      Если запытаю створенје изо мѣте "/api/v0/tags/create.json" сꙛ даными:
         | id              | 10003                                |
         | appellation     | Мѣтаоо                               |
         | title           | Славника Титулв                      |
         | description     | not wrong                            |
         | kind            | помѣстна                             |
         | language_code   | ру                                   |
         | alphabeth_code  | РУ                                   |
      То добѫдꙛ кодъ поврата "200"
      А сѫбуке сѫ таковы:
         | language        | ру                                   |
         | alphabeth       | РУ                                   |
      И добѫдꙛ выводъ:
         """
         ---
         id: 10003
         kind: помѣстна
         kind_title: Помѣстна мѣтка
         appellation: Мѣтаоо
         title: Славника Титулв
         description: not wrong
         tagged_count: 0
         """
      А изнахоѕь мѣте "10003" бѫдє єствовати

   @update @object @json @error @404
   Пример: Користник поновяє дане мѣте
      Если запытаю одсланје мѣте в изнаходь "/api/v0/tags/Мѣта.json" сꙛ даными:
         | id              | 10000                                |
         | appellation     | Мѣтак                                |
         | title           | Славник Нов                          |
         | description     | Ново                                 |
         | kind            | обычна                               |
         | language_code   | ру                                   |
         | alphabeth_code  | РУ                                   |
      То добѫдꙛ кодъ поврата "200"
      И добѫдꙛ выводъ:
         """
         ---
         id: 10000
         kind: обычна
         kind_title: Простая мѣтка
         appellation: Мѣтак
         title: Славник Нов
         description: Ново
         tagged_count: 0
         """
      Если запытаю добыванје из изо "/api/v0/tags/Мѣтак.json"
      То добѫдꙛ кодъ поврата "200"
      И добѫдꙛ выводъ:
         """
         ---
         id: 10000
         kind: обычна
         kind_title: Простая мѣтка
         appellation: Мѣтак
         title: Славник Нов
         description: Ново
         tagged_count: 0
         """
      Если запытаю добыванје из изо "/api/v0/tags/Мѣта.json"
      То добѫдꙛ кодъ поврата "404"

   @get @object @json
   Пример: Користник добыває дане мѣте· иззначену краткꙛ именем
      Если запытаю добыванје из изо "/api/v0/tags/Мѣта.json"
      То добѫдꙛ выводъ:
         """
         ---
         id: 10000
         kind: обычна
         kind_title: Простая мѣтка
         appellation: Мѣта
         title: Славник Титул
         description: Описаловое
         tagged_count: 0
         """

   @delete @object @json
   Пример: Користник изтьрає иззначену плашкој мѣту 
      Если сꙛбуке для правача сѫ таковы:
         | language        | др                                   |
         | alphabeth       | ДР                                   |
      И запытаю изтрѣнје изо "/api/v0/tags/Мѣтаа.json"
      То добѫдꙛ кодъ поврата "200"
      И добѫдꙛ выводъ:
         """
         ---
         id: 10001
         kind: помѣстна
         kind_title:
         appellation: Мѣтаа
         title: Славника Титул
         description: Описалово
         tagged_count: 0
         """
      И изнахоѕи мѣте "Мѣтаа" не бѫдє

   @get @collection @json @error
   Пример: Запрос к правачу мѣт в АПИ при отсутствии мѣт
      Пусть не єствує ни єдне мѣте
      Если покушаю створити "GET" запытъ до адреса "/api/v0/tags.jsonp"
      То не добѫдꙛ кодъ поврата
      А вывода не бѫдє
